{
    "21": "The fire lily is a flower that grows in the meadows of the Fire Nation, such as the grassy fields near Hama's village. The vibrant, red blossoms of this flower bloom just a few weeks every year around the middle of summer, and are typically shredded once they dry out. Many annual Fire Lily Festivals are held throughout the Fire Nation during their blooming period",
    "3": "Campanula medium, common name Canterbury bells, is an annual or biennial flowering plant of the genus Campanula, belonging to the family Campanulaceae. In floriography, it represents gratitude, or faith and constancy.",
    "45": "Eustoma russellianum, is a species of flowering plant in the gentian family. Its previous binomial name was Eustoma grandiflorum. Common names include Texas bluebells, Texas bluebell, bluebell, showy prairie gentian etc.",
    "1": "Pink evening primrose is Oenothera speciosa, and is also sometimes called showy evening primrose and pink ladies. It is native to the southeastern U.S. and is considered an attractive wildflower in many locations. ",
    "34": "Cosmos bipinnatus, commonly called the garden cosmos or Mexican aster, is a medium-sized flowering herbaceous plant native to the Americas. The species and its varieties and cultivars are popular as an ornamental plant in temperate climate gardens",
    "27": "Amaranthus hypochondriacus is an ornamental plant commonly known as Prince-of-Wales feather or prince s-feather. Originally endemic to Mexico, it is called quelite, blero.",
    "7": "Phalaenopsis amabilis, commonly known as the moon orchid or moth orchid in India and as anggrek bulan in Indonesia, is a species of flowering plant in the orchid family Orchidaceae, native to the East Indies and Australia, and widely cultivated as a decorative houseplant. It is an epiphytic or lithophytic herb with long, thick roots, between two and eight thick, fleshy leaves with their bases hiding the stem and nearly flat, white, long-lasting flowers on a branching flowering stem with up to ten flowers on each branch",
    "16": "Trollius is a genus of about 30 species of flowering plants closely related to Ranunculus, in the family Ranunculaceae. The common name of some species is globeflower or globe flower. Native to the cool temperate regions of the Northern Hemisphere, with the greatest diversity of species in Asia, Trollius usually grow in heavy, wet clay soils",
    "25": "Muscari is a genus of perennial bulbous plants native to Eurasia that produce spikes of dense, most commonly blue, urn-shaped flowers resembling bunches of grapes in the spring. The common name for the genus is grape hyacinth ,a name which is also used for the related genera Leopoldia and Pseudomuscari, which were formerly included in Muscari, but they should not be confused with hyacinths. In the United States, they are also commonly referred to as bluebells, though certain regions reserve this name for bluebonnets instead",
    "26": "Papaver rhoeas common names include common poppy, corn poppy, corn rose, field poppy, Flanders poppy, or red poppy is an annual herbaceous species of flowering plant in the poppy family, Papaveraceae. ",
    "79": "Tricyrtis is a genus of Asian flowering plants in the lily family, with approximately 20 known species. The species are commonly known in English as toad lilies. The genus has a native range from the Himalayas to eastern Asia, including China, Japan, Philippines and Taiwan, and a few species are cultivated for their ornamental qualities in other parts of the world",
    "39": "Curcuma alismatifolia, Siam tulip or summer tulip  is a tropical plant native to Laos, northern Thailand, and Cambodia. Despite its name, it is not related to the tulip, but to the various ginger species such as turmeric. It can grow as an indoor plant, and is also sold as a cut flower.",
    "24": "Alpinia purpurata, red ginger, also called ostrich plume and pink cone ginger, are native Malaysian plants with showy flowers on long brightly colored red bracts. They look like the bloom, but the true flower is the small white flower on top.Red ginger can also be grown in South Florida since, in general, the region does not fall below freezing temperatures. It prefers partial shade and moist humid conditions, although it can tolerate full sun in some climates. It tends to like to be well watered and not left to dry out.",
    "67": "Crocus vernus (spring crocus, giant crocus) is a species in Family Iridaceae, native to the Alps, the Pyrenees, and the Balkans. Its cultivars and those of Crocus flavus (Dutch crocus) are used as ornamental plants. The Dutch crocuses are larger than the other cultivated crocus species (e.g., Crocus chrysanthus). Depending on the year, Crocus vernus starts flowering about the same time or up to 2 weeks after Crocus chrysanthus (snow crocus) starts flowering",
    "35": "Eryngium alpinum is a hemicryptophyte, its overwintering buds are situated just below the soil surface and the floral axis more or less erect with a few leaves. The roots are deep and robust.The stems are solitary and erect, usually with three branches on the apex and with longitudinal purple stripes",
    "32": "Phlox paniculata, commonly called fall phlox or garden phlox, is a species of flowering plant in the phlox family (Polemoniaceae). It is native to parts of the eastern and central United States. It is extensively cultivated in temperate regions as an ornamental plant and has become established in the wild in scattered locales in other regions. It is called perennial phlox,summer phlox, or panicled phlox.",
    "10": "Echinops is a genus of about 120 species of flowering plants in the daisy family Asteraceae, commonly known as globe thistles. They have spiny foliage and produce blue or white spherical flower heads. They are native to Europe, east to central Asia, and south to the mountains of tropical Africa. Globe thistle is the host plant of weevil Larinus vulpes",
    "6": "Lilium lancifolium  is an Asian species of lily, native to China, Japan, Korea, and the Russian Far East. It is widely planted as an ornamental because of its showy orange-and-black flowers, and has become naturalized in numerous scattered locations in eastern North America (particularly in New England).It bears the proper common English name tiger lily, but that name has been applied to other species as well",
    "93": "Tillandsia recurvata, commonly known as small ballmoss or ball moss, is a flowering plant (not a true moss) in the family Bromeliaceae that grows upon larger host plants. It grows well in areas with low light, little airflow, and high humidity, which is commonly provided by southern shade trees, often the southern live oak (Quercus virginiana). It is not a parasite like mistletoe, but an epiphyte like its relative Spanish moss.",
    "33": "Nigella damascena, love-in-a-mist, ragged lady or devil in the bush, is an annual garden flowering plant, belonging to the buttercup family Ranunculaceae. It is native to southern Europe (but adventive in more northern countries of Europe), north Africa and southwest Asia, where it is found on neglected, damp patches of land.The specific epithet damascena relates to Damascus in Syria. The plant s common name comes from the flower being nestled in a ring of multifid, lacy bracts",
    "9": "Aconitum also known as aconite, monkshood, wolf's-bane, leopard's bane, mousebane, women's bane, devil's helmet, queen of poisons, or blue rocket, is a genus of over 250 species of flowering plants belonging to the family Ranunculaceae. These herbaceous perennial plants are chiefly native to the mountainous parts of the Northern Hemisphere, growing in the moisture-retentive but well-draining soils of mountain meadows. Most species are extremely poisonous and must be dealt with very carefully. Several Aconitum hybrids, such as the Arendsii form of Aconitum carmichaelii, have won gardening awards such as the Royal Horticultural Society s Award of Garden Merit. Some are used by florists",
    "102": "Iris domestica, commonly known as leopard lily, blackberry lily, and leopard flower, is an ornamental plant in the family Iridaceae. In 2005, based on molecular DNA sequence evidence, Belamcanda chinensis, the sole species in the genus Belamcanda, was transferred to the genus Iris and renamed Iris domestica. Other synonyms are Epidendrum domesticum L., Vanilla domestica (L.) Druce, Belamcanda punctata Moench, Gemmingia chinensis (L.) Kuntze, Ixia chinensis L., Morea chinensis, and Pardanthus chinensis Ker Gawl.)",
    "14": "Cirsium vulgare, the spear thistle, bull thistle, or common thistle, is a species of the Asteraceae genus Cirsium, native throughout most of Europe (north to 66°N, locally 68°N), Western Asia (east to the Yenisei Valley), and northwestern Africa (Atlas Mountains).It is also naturalised in North America, Africa, and Australia and is an invasive weed in some areas.It is the national flower of Scotland.The plant provides a great deal of nectar for pollinators. It was rated in the top 10 for most nectar production (nectar per unit cover per year) in a UK plants survey conducted by the AgriLand project which is supported by the UK Insect Pollinators Initiative.",
    "19": "Platycodon grandiflorus  is a species of herbaceous flowering perennial plant of the family Campanulaceae, and the only member of the genus Platycodon. It is native to East Asia (China, Korea, Japan, and the Russian Far East). It is commonly known as balloon flower (referring to the balloon-shaped flower buds),Chinese bellflower,or platycodon",
    "100": "Gaillardia (common name blanket flower) is a genus of flowering plants in the sunflower family, Asteraceae, native to North and South America. It was named after Maître Gaillard de Charentonneau, an 18th-century French magistrate who was an enthusiastic botanist. The common name may refer to the resemblance of the inflorescence to the brightly patterned blankets made by Native Americans, or to the ability of wild taxa to blanket the ground with colonies. Many cultivars have been bred for ornamental use.",
    "13": "Protea cynaroides, the king protea, is a flowering plant. It is a distinctive member of Protea, having the largest flower head in the genus. The species is also known as giant protea, honeypot or king sugar bush. It is widely distributed in the southwestern and southern parts of South Africa in the fynbos region.The king protea is the national flower of South Africa. It also is the flagship of the Protea Atlas Project, run by the South African National Botanical InstitutThe king protea has several colour forms and horticulturists have recognized 81 garden varieties, some of which have injudiciously been planted in its natural range. In some varieties the pink of the flower and red borders of leaves are replaced by a creamy yellow.cynaroides is adapted to survive wildfires by its thick underground stem, which contains many dormant buds; these will produce the new growth after the fire",
    "49": "Leucanthemum vulgare, commonly known as the ox-eye daisy, oxeye daisy, dog daisy, marguerite (French: Marguerite commune, common marguerite) and other common names, is a widespread flowering plant native to Europe and the temperate regions of Asia, and an introduced plant to North America, Australia and New Zealand.",
    "15": "Iris pseudacorus, the yellow flag, yellow iris, or water flag, is a species of flowering plant in the family Iridaceae. It is native to Europe, western Asia and northwest Africa. Its specific epithet pseudacorus means false acorus, referring to the similarity of its leaves to those of Acorus calamus (sweet flag), as they have a prominently veined mid-rib and sword-like shape. However, the two plants are not closely related.",
    "61": "Cautleya spicata is a perennial herbaceous plant in the family Zingiberaceae (the gingers). It is found in the Himalayas through to China (Yunnan). It is cultivated as an ornamental garden plant, hardy to a few degrees of frost.",
    "31": "Dianthus caryophyllus, commonly known as the carnation or clove pink, is a species of Dianthus. It is probably native to the Mediterranean region but its exact range is unknown due to extensive cultivation for the last 2,000 years",
    "64": "Convolvulus cneorum, the silverbush or shrubby bindweed, is a species of flowering plant in the family Convolvulaceae, which contains many plants described as bindweed. The Latin specific epithet cneorum is a word of Greek origin referring to a small olive-like plant, possibly a species of Daphne.",
    "68": "Iris is a genus of 260–300 species of flowering plants with showy flowers. It takes its name from the Greek word for a rainbow, which is also the name for the Greek goddess of the rainbow, Iris. Some authors state that the name refers to the wide variety of flower colors found among the many species. As well as being the scientific name, iris is also widely used as a common name for all Iris species, as well as some belonging to other closely related genera. A common name for some species is 'flags', while the plants of the subgenus Scorpiris are widely known as 'junos', particularly in horticulture. It is a popular garden flower.",
    "63": "Rudbeckia hirta, commonly called black-eyed Susan, is a North American flowering plant in the sunflower family, native to Eastern and Central North America and naturalized in the Western part of the continent as well as in China. It has now been found in all 10 Canadian Provinces and all 48 of the states in the contiguous United States..",
    "69": "Anemonoides nemorosa (syn. Anemone nemorosa), the wood anemone, is an early-spring flowering plant in the buttercup family Ranunculaceae, native to Europe. Other common names include windflower, thimbleweed, and smell fox, an allusion to the musky smell of the leaves. It is a perennial herbaceous plant growing 5–15 cm (2–6 in) tall.",
    "62": "Anemone hupehensis, Anemone hupehensis var. japonica, and Anemone × hybrida (commonly known as the Chinese anemone or Japanese anemone, thimbleweed, or windflower) are species of flowering herbaceous perennials in the family Ranunculaceae.Anemone × hybrida Paxton is a hybrid of Anemone hupehensis var. japonica and Anemone vitifolia. It should not be confused with Anemone hybrida Miq. ex Pritz., a synonym of Anemone halleri All",
    "20": "Zantedeschia aethiopica, commonly known as calla lily and arum lily, is a species in the family Araceae, native to southern Africa in Lesotho, South Africa, and Swaziland.Zantedeschia aethiopica is a rhizomatous herbaceous perennial plant, evergreen where rainfall and temperatures are adequate, deciduous where there is a dry season. Its preferred habitat is in streams and ponds or on the banks. It grows to 0.6–1 m (2.0–3.3 ft) tall, with large clumps of broad, arrow shaped dark green leaves up to 45 cm (18 in) long.",
    "38": "Astrantia major, the great masterwort, is a species of flowering plant in the family Apiaceae, native to central and eastern Europe. Growing to 90 cm (35 in) tall by 45 cm (18 in) broad, it is an herbaceous perennial, much used in gardens.The plant also produces an essential oil, that can be used in herbal medicines. It also contains an Amino acid.",
    "4": "The sweet pea, Lathyrus odoratus, is a flowering plant in the genus Lathyrus in the family Fabaceae (legumes), native to Sicily, southern Italy and the Aegean Islands.It is an annual climbing plant, growing to a height of 1–2 metres (3 ft 3 in–6 ft 7 in), where suitable support is available. The leaves are pinnate with two leaflets and a terminal tendril, which twines around supporting plants and structures, helping the sweet pea to climb. In the wild plant the flowers are purple, 2–3.5 centimetres (0.79–1.38 in) broad; they are larger and very variable in colour in the many cultivars. Flowers are usually strongly scented.",
    "86": "Lavatera is a genus of about 25 species of flowering plants in the mallow family Malvaceae, native to Macaronesia, North Africa, Europe, central and southwestern Asia, Ethiopia, North America (California and Mexico) and Australia, with a centre of distribution in the Mediterranean region. A number of species are naturalized in North America and elsewhere.All species previously placed in Lavatera have now been transferred to the related genus Malva. Lavatera species are known as tree mallows, or rather ambiguously as rose mallows, royal mallows or annual mallows.The genus includes annual, biennial and perennial herbaceous plants and soft-wooded shrubs, growing from 1–3 m tall. The leaves are spirally arranged, and palmately lobed. The flowers are conspicuous, 4–12 cm diameter, with five white, pink or red petals; they are produced in terminal clusters",
    "101": "Campsis radicans, the trumpet vine or trumpet creeper (also known in North America as cow itch vine or hummingbird vine), is a species of flowering plant of the family Bignoniaceae, native to the eastern United States and extreme southern Ontario and naturalized in parts of the western United States as well as in Ontario and southern Quebec, parts of Europe, and scattered locations in Latin America. Growing to 10 m (33 ft), it is a vigorous, deciduous woody vine, notable for its showy trumpet-shaped flowers. It inhabits woodlands and riverbanks, and is also a popular garden subject.",
    "42": "Narcissus is a genus of predominantly spring flowering perennial plants of the amaryllis family, Amaryllidaceae. Various common names including daffodil, narcissus and jonquil are used to describe all or some members of the genus. Narcissus has conspicuous flowers with six petal-like tepals surmounted by a cup- or trumpet-shaped corona. The flowers are generally white or yellow (also orange or pink in garden varieties), with either uniform or contrasting coloured tepals and corona.Narcissus were well known in ancient civilisation, both medicinally and botanically, but formally described by Linnaeus in his Species Plantarum (1753). The genus is generally considered to have about ten sections with approximately 50 species.",
    "22": "Scabiosa  is a genus in the honeysuckle family (Caprifoliaceae) of flowering plants. Many of the species in this genus have common names that include the word scabious, but some plants commonly known as scabious are currently classified in related genera such as Knautia and Succisa; at least some of these were formerly placed in Scabiosa. Another common name for members of this genus is pincushion flowers.",
    "2": "Paphiopedilum micranthum, described in 1951, is commonly known as the Silver Slipper Orchid or Hard-leaved Pocket Orchid. It blooms during late winter to early summer with one flower per inflorescence. As opposed to its close sibling Paph. malipoense, the flowers of Paph. micranthum have no fragrance.",
    "54": "Helianthus is a genus comprising about 70 species of annual and perennial flowering plants in the daisy family Asteraceae.Except for three South American species, the species of Helianthus are native to North America and Central America. The common names sunflower and common sunflower typically refer to the popular annual species Helianthus annuus, whose round flower heads in combination with the ligules look like the sun. This and other species, notably Jerusalem artichoke (H. tuberosus), are cultivated in temperate regions and some tropical regions as food crops for humans, cattle, and poultry, and as ornamental plants. The species H. annuus typically grows during the summer and into early fall, with the peak growth season being mid-summer.",
    "66": "Osteospermum  is a genus of flowering plants belonging to the Calenduleae, one of the smaller tribes of the sunflower/daisy family Asteraceae. They are known as the daisybushes or African daisies.Osteospermum used to belong to the genus Dimorphotheca, but only the annual species remain in that genus; the perennials belong to Osteospermum. The genus Osteospermum is also closely related to the small genus Chrysanthemoides, such as C. incana and C. monilifera",
    "70": "Romneya coulteri, the Coulter's Matilija poppy or California tree poppy, is a perennial species of flowering plant in the poppy family. Native to southern California and Baja California, it grows in dry canyons in chaparral and coastal sage scrub plant communities, sometimes in areas recently burned. It is a popular ornamental plant, kept for its large, showy flowers.The specific epithet coulteri commemorates Thomas Coulter, an Irish botanist and explorer.",
    "85": "The desert rose (Adenium obesum) is a slow-growing plant (gaining less than 12 inches per year) that boasts a thick, succulent stem and deep pink flowers. It belongs to the genera Apocynaceae, which is native to Africa, the Middle East, and Madagascar. The desert rose is the only Adenium found in wide cultivation, although it has been hybridized extensively to obtain different flower colors (like orange and striped).",
    "99": "Bromelia is the type genus of the plant family Bromeliaceae, subfamily Bromelioideae. Bromelia species are widespread across much of Latin America and the West Indies, and are characterized by flowers with a deeply cleft calyx. The genus is named after the Swedish medical doctor and botanist Olof Bromelius (1639-1705)",
    "87": "Magnolia is a large genus of about 210 flowering plant species in the subfamily Magnolioideae of the family Magnoliaceae. It is named after French botanist Pierre Magnol.Magnolia is an ancient genus. Appearing before bees did, the flowers are theorized to have evolved to encourage pollination by beetles. To avoid damage from pollinating beetles, the carpels of Magnolia flowers are extremely tough. Fossilized specimens of M. acuminata have been found dating to 20 million years ago, and of plants identifiably belonging to the Magnoliaceae date to 95 million years ago. Another aspect of Magnolia considered to represent an ancestral state is that the flower bud is enclosed in a bract rather than in sepals; the perianth parts are undifferentiated and called tepals rather than distinct sepals and petals. Magnolia shares the tepal characteristic with several other flowering plants near the base of the flowering plant lineage such as Amborella and Nymphaea as well as with many more recently derived plants such as Lilium.",
    "5": "Calendula officinalis, the pot marigold, ruddles, common marigold or Scotch marigold, is a flowering plant in the daisy family Asteraceae. It is probably native to southern Europe, though its long history of cultivation makes its precise origin unknown, and it may possibly be of garden origin. It is also widely naturalised farther north in Europe (as far as southern England) and elsewhere in warm temperate regions of the world",
    "92": "Monarda is a genus of flowering plants in the mint family, Lamiaceae. The genus is endemic to North America. Common names include bee balm, horsemint, oswego tea, the latter inspired by the fragrance of the leaves, which is reminiscent of bergamot orange (Citrus bergamia). The genus was named for the Spanish botanist Nicolás Monardes, who wrote a book in 1574 describing plants of the New World.",
    "28": "Gentiana acaulis, the stemless gentian, or trumpet gentian, is a species of flowering plant in the family Gentianaceae, native to central and southern Europe, from Spain east to the Balkans, growing especially in mountainous regions, such as the Alps and Pyrenees, at heights of 800–3,000 m (2,625–9,843 ft).It is a perennial plant, growing up to a height of 10 centimetres (3.9 in) tall and forming a mat up to 50 centimetres (20 in) wide.[5] The leaves, which can be lanceolate, elliptical or obovate,[3] are evergreen, 2–3.5 cm long, in a basal rosette, forming clumps. The trumpet-shaped terminal flowers are blue with olive-green spotted longitudinal throats. They grow on a very short peduncle, 3–6 cm long. The flower stem is often without leaves, or has 1 or 2 pairs of leaves. It likes full sun, is fully hardy and flowers in late spring and summer.",
    "97": "Malva is a genus of about 25–30 species of herbaceous annual, biennial, and perennial plants in the family Malvaceae (of which it is the type genus), one of several closely related genera in the family to bear the common English name mallow. The genus is widespread throughout the temperate, subtropical and tropical regions of Africa, Asia and Europe.",
    "57": "Gaura is a genus of flowering plants in the family Onagraceae, native to North America. The genus includes many species known commonly as beeblossoms. Recent genetic research has shown that the genus is paraphyletic unless the monotypic genus Stenosiphon is included within Gaura, increasing the number of species in the genus to 22.[1][2][3]They are annual, biennial or perennial herbaceous plants; most are perennials with sturdy rhizomes, often forming dense thickets, crowding or shading out other plant species. They have a basal rosette of leaves, with erect or spreading flowering stems up to 2 m (rarely more) tall, leafy on the lower stem, branched and leafless on the upper stem. The flowers have four (rarely three) petals; they are zygomorphic, with all the petals directed somewhat upwards. The fruit is an indehiscent nut-like body containing reddish-brown seeds. It reproduces via seeds and also by rhizome growth.",
    "40": "Commonly known as hellebores , the Eurasian genus Helleborus consists of approximately 20 species of herbaceous or evergreen perennial flowering plants in the family Ranunculaceae, within which it gave its name to the tribe of Helleboreae. Despite names such as winter rose,Christmas rose and Lenten rose, hellebores are not closely related to the rose family (Rosaceae).[4] Many hellebore species are poisonous.",
    "47": "Marigolds are a favorite, no-fuss annual that can bring the color of sunshine to your garden, as well as butterflies, bees, ladybugs, and other beneficial insects. Give them full sun and some well-draining soil and watch them bloom from late spring until fall.Marigold seeds germinate quickly, within just a few days, and bloom in about 8 weeks. This quick sense of satisfaction makes them a great first-time gardening project for kids and garden newbies. Not to mention, marigolds are a great companion in your vegetable garden and can help protect your veggies from predators and pests",
    "59": "Orange dahlias come in a range of shades and flower shapes, from peach pompons to fiery cactus types. ... Orange dahlias are often paired with purple-flowered plants, but work just as well in kaleidoscopic jewel gardens or hot-toned borders. Related content: Plants with orange flowers. Eight perennials for a hot border",
    "48": "Ranunculus is a large genus of about 500 species of flowering plants in the family Ranunculaceae. Members of the genus are known as buttercups, spearworts and water crowfoots.The familiar and widespread buttercup of gardens throughout Northern Europe (and introduced elsewhere) is the creeping buttercup Ranunculus repens, which has extremely tough and tenacious roots. Two other species are also widespread, the bulbous buttercup Ranunculus bulbosus and the much taller meadow buttercup Ranunculus acris. In ornamental gardens, all three are often regarded as weeds.",
    "55": "Pelargonium  is a genus of flowering plants which includes about 280 species of perennials, succulents, and shrubs, commonly known as geraniums, pelargoniums, or storksbills.[4] Geranium is also the botanical name and common name of a separate genus of related plants, also known as cranesbills. Both genera belong to the family Geraniaceae. Carl Linnaeus originally included all the species in one genus, Geranium, and they were later separated into two genera by Charles Louis L'Héritier de Brutelle in 1789.Pelargonium species are evergreen perennials indigenous to temperate and tropical regions of the world, with many species in southern Africa. They are drought and heat tolerant, but can tolerate only minor frosts. Some species are extremely popular garden plants, grown as houseplants and bedding plants in temperate regions. They have a long flowering period, with flowers mostly in purple, red and orange, or white.",
    "36": "This plant grows in the northeastern area of Brazil, in the states of Pernambuco and Alagoas. They grow to different sizes depending on the area from which they originate. Those that are growing in Pernambuco are smaller, with small but colored flowers, with most of them being lilac. The interior part of the flower is a dark lilac color. Plants from Alagoas are bigger and have larger flowers. Some varieties, such as Cattleya labiata var. semialba, have large white flowers with a touch of yellow. There is another variety of semialba, with lilac in the inferior part of the flower. This plant is an epiphyte, growing up in trees, where light is plentiful. However, there are also many other places where this plant could grow, such as directly on rock with very little soil",
    "91": "Hippeastrum  is a genus of about 90 species and over 600 hybrids and cultivars of perennial herbaceous bulbous plants. They generally have large fleshy bulbs and tall broad leaves, generally evergreen, and large red or purple flowers.Hippeastrum is a genus in the family Amaryllidaceae (subfamily Amaryllidoideae, tribe Hippeastreae, and subtribe Hippeastrineae). The name Hippeastrum, given to it by William Herbert, means knight's star, although precisely what Herbert meant by the name is not certain. For many years there was confusion among botanists over the generic names Amaryllis and Hippeastrum, one result of which is that the common name amaryllis is mainly used for cultivars of this genus, often sold as indoor flowering bulbs particularly at Christmas in the northern hemisphere.",
    "29": "The globe artichoke (Cynara cardunculus var. scolymus), also known by the names French artichoke and green artichoke in the U.S., is a variety of a species of thistle cultivated as a food.The edible portion of the plant consists of the flower buds before the flowers come into bloom. The budding artichoke flower-head is a cluster of many budding small flowers (an inflorescence), together with many bracts, on an edible base. Once the buds bloom, the structure changes to a coarse, barely edible form. Another variety of the same species is the cardoon, a perennial plant native to the Mediterranean region. Both wild forms and cultivated varieties (cultivars) exist.",
    "71": "Gazania  is a genus of flowering plants in the family Asteraceae, native to Southern Africa.They produce large, daisy-like composite flowerheads in brilliant shades of yellow and orange, over a long period in summer. They are often planted as drought-tolerant groundcover",
    "90": "Canna or canna lily is the only genus of flowering plants in the family Cannaceae, consisting of 10 species. Cannas are not true lilies, but have been assigned by the APG II system of 2003 to the order Zingiberales in the monocot clade Commelinids, together with their closest relatives, the gingers, spiral gingers, bananas, arrowroots, heliconias and birds of paradise.The plants have large foliage and horticulturists have developed selected forms as large-flowered garden plants. Cannas are also used in agriculture as a rich source of starch for human and animal consumption",
    "18": "Alstroemeria , commonly called the Peruvian lily or lily of the Incas, is a genus of flowering plants in the family Alstroemeriaceae. They are all native to South America although some have become naturalized in the United States, Mexico, Australia, New Zealand, Madeira and the Canary Islands. Almost all of the species are restricted to one of two distinct centers of diversity, one in central Chile, the other in eastern Brazil. Species of Alstroemeria from Chile are winter-growing plants while those of Brazil are summer-growing. All are long-lived perennials except A. graminea, a diminutive annual from the Atacama Desert of Chile.",
    "98": "Ruellia simplex, the Mexican petunia, Mexican bluebell or Britton's wild petunia, is a species of flowering plant in the family Acanthaceae. It is a native of Mexico, the Caribbean, and South America. It has become a widespread invasive plant in Florida, where it was likely introduced as an ornamental before 1933.Ruellia simplex is native to Mexico, the West Indies, western Bolivia, southwestern Brazil, Paraguay, Uruguay, and northeastern Argentina. It has been widely used as an ornamental plant and has escaped from cultivation in the United States, Australia and parts of Asia, as well as several Pacific Islands",
    "8": "Strelitzia reginae is a species of evergreen tropical herbaceous plant, native to South Africa. Given its own family Strelitziaceae by taxonomists, it is still closely related to bananas (Musaceae). Many often mistakenly call this plant the banana tree because it looks like banana plants. These regal plants (for which they are named, reginae) are named for the beautiful, orange crane-like flowers that they produce, like birds of paradise. Under the right conditions, including full, southern light exposure, proper humidity and temperature, Bird of Paradise may flower indoors, although this is rare",
    "30": "Dianthus barbatus, the sweet William, is a species of flowering plant in the family Caryophyllaceae, native to southern Europe and parts of Asia. It has become a popular ornamental garden plant. It is a herbaceous biennial or short-lived perennial plant growing to 13–92 cm tall, with flowers in a dense cluster of up to 30 at the top of the stems. Each flower is 2–3 cm diameter with five petals displaying serrated edges. Wild plants produce red flowers with a white base, but colours in cultivars range from white, pink, red, and purple to variegated patterns. The exact origin of its English common name is unknown but first appears in 1596 in botanist John Gerard's garden catalogue. The flowers are edible and may have medicinal properties.[citation needed] Sweet William attracts bees, birds, and butterflies.",
    "17": "Echinacea purpurea (eastern purple coneflower, purple coneflower, hedgehog coneflower, or echinacea) is a North American species of flowering plant in the sunflower family. It is native to parts of eastern North America and present to some extent in the wild in much of the eastern, southeastern and midwestern United States as well as in the Canadian Province of Ontario. It is most common in the Ozarks and in the Mississippi/Ohio Valley. Its habitats include dry open woods, prairies and barrens.",
    "52": "Wild pansy (Viola tricolor), also known as Johnny Jump up (though this name is also applied to similar species such as the yellow pansy), heartsease, heart's ease, heart's delight, tickle-my-fancy, Jack-jump-up-and-kiss-me, come-and-cuddle-me, three faces in a hood, or love-in-idleness, is a common European wild flower, growing as an annual or short-lived perennial.It has been introduced into North America, where it has spread. It is the progenitor of the cultivated pansy, and is therefore sometimes called wild pansy; before the cultivated pansies were developed, pansy was an alternative name for the wild form. It can produce up to 50 seeds at a time. The flowers can be purple, blue, yellow or white",
    "84": "Aquilegia (common names: granny's bonnet, columbine) is a genus of about 60–70 species of perennial plants that are found in meadows, woodlands, and at higher altitudes throughout the Northern Hemisphere, known for the spurred petals  of their flowers.The leaves of this plant are compound and the flowers contain five sepals, five petals and five pistils. The fruit is a follicle which holds many seeds and is formed at the end of the pistils. Underneath the flower are spurs which contain nectar, mainly consumed by long-beaked birds such as hummingbirds. Almost all Aquilegia species have a ring of staminodia around the base of the stigma, which may help protect against insects",
    "12": "Tussilago farfara, commonly known as coltsfoot, is a plant in the groundsel tribe in the daisy family Asteraceae, native to Europe and parts of western and central Asia. The name tussilago is derived from the Latin tussis, meaning cough, and ago, meaning to cast or to act on.[4][5] It has had uses in traditional medicine, but the discovery of toxic pyrrolizidine alkaloids in the plant has resulted in liver health concerns.Tussilago farfara is the only accepted species in the genus Tussilago, although more than two dozen other species have at one time or another been considered part of this group.",
    "11": "Antirrhinum is a genus of plants commonly known as dragon flowers or snapdragons because of the flowers' fancied resemblance to the face of a dragon that opens and closes its mouth when laterally squeezed. They are native to rocky areas of Europe, the United States, and North Africa.",
    "96": "Camellia  is a genus of flowering plants in the family Theaceae. They are found in eastern and southern Asia, from the Himalayas east to Japan and Indonesia. There are 100–300 described species, with some controversy over the exact number. There are also around 3,000 hybrids. The genus was named by Linnaeus after the Jesuit botanist Georg Joseph Kamel, who worked in the Philippines and described a species of camellia (although Linnaeus did not refer to Kamel's account when discussing the genus). Camellias are famous throughout East Asia; they are known as  (tea flower) in Chinese, tsubaki  in Japanese, dongbaek-kkot  in Korean, and as hoa trà or hoa chè in Vietnamese.",
    "23": "Fritillaria (fritillaries) is a genus of spring flowering herbaceous bulbous perennial plants in the lily family (Liliaceae). The type species, Fritillaria meleagris, was first described in Europe in 1571, while other species from the Middle East and Asia were also introduced to Europe at that time. The genus has about 130–140 species divided among eight subgenera. The flowers are usually solitary, nodding and bell-shaped with bulbs that have fleshy scales, resembling those of lilies. They are known for their large genome size and genetically are very closely related to lilies. They are native to the temperate regions of the Northern hemisphere, from the Mediterranean and North Africa through Eurasia and southwest Asia to western North America. Many are endangered due to enthusiastic picking.",
    "50": "The common dandelion is well known for its yellow flower heads that turn into round balls of silver tufted fruits that disperse in the wind. These balls are usually called clocks in both British and American English.The name blowball has also been used.It grows in temperate regions of the world, in lawns, on roadsides, on disturbed banks and shores of waterways, and other areas with moist soils. T. officinale is considered a weed, especially in lawns and along roadsides, but it is sometimes used as a medical herb and in food preparation.",
    "44": "The poinsettia  (Euphorbia pulcherrima) is a commercially important plant species of the diverse spurge family (Euphorbiaceae). Indigenous to Central America, it was described as a new species in 1834. It is particularly well known for its red and green foliage and is widely used in Christmas floral displays. It derives its common English name from Joel Roberts Poinsett, the first United States Minister to Mexico, who is credited with introducing the plant to the US in the 1820s. Poinsettias are shrubs or small trees, with heights of 0.6–4 m (2.0–13.1 ft). Though often stated to be highly toxic, the poinsettia is not dangerous to pets or children. Exposure to the plant, even consumption, most often results in no effect, though it can cause nausea, vomiting, or diarrhea",
    "53": "Primula  is a genus of mainly herbaceous flowering plants in the family Primulaceae. They include the familiar wildflower of banks and verges, the primrose (P. vulgaris). Other common species are P. auricula (auricula), P. veris (cowslip) and P. elatior (oxlip). These species and many others are valued for their ornamental flowers. They have been extensively cultivated and hybridised - in the case of the primrose, for many hundreds of years. Primula are native to the temperate northern hemisphere, south into tropical mountains in Ethiopia, Indonesia and New Guinea, and in temperate southern South America. Almost half of the known species are from the Himalayas",
    "72": "Azaleas  are flowering shrubs in the genus Rhododendron, particularly the former sections Tsutsuji (evergreen) and Pentanthera (deciduous). Azaleas bloom in the spring (May and June in the temperate Northern Hemisphere), their flowers often lasting several weeks. Shade tolerant, they prefer living near or under trees. They are part of the family Ericaceae.",
    "65": "Eschscholzia californica, the California poppy, golden poppy, California sunlight or cup of gold, is a species of flowering plant in the family Papaveraceae, native to the United States and Mexico. It is cultivated as an ornamental plant flowering in summer, with showy cup-shaped flowers in brilliant shades of red, orange and yellow (occasionally pink). It is also used as food or a garnish. It became the official state flower of California in 1903.",
    "80": "Anthurium , is a genus of about 1000 species of flowering plants, the largest genus of the arum family, Araceae. General common names include anthurium, tailflower, flamingo flower, and laceleaf.The genus is native to the Americas, where it is distributed from northern Mexico to northern Argentina and parts of the Caribbean.Anthurium is a genus of herbs often growing as epiphytes on other plants. Some are terrestrial. The leaves are often clustered and are variable in shape. The inflorescence bears small flowers which are perfect, containing male and female structures. The flowers are contained in dense spirals on the spadix. The spadix is often elongated into a spike shape, but it can be globe-shaped or club-shaped. Beneath the spadix is the spathe, a type of bract.",
    "76": "Morning glory (also written as morning-glory) is the common name for over 1,000 species of flowering plants in the family Convolvulaceae, whose current taxonomy and systematics are in flux. Morning glory species belong to many genera, some of which are:Argyreia,Astripomoea,Calystegia,Convolvulus,Ipomoea,Lepistemon,Merremia,Operculina,Stictocardia.Most morning glory flowers unravel into full bloom in the early morning. The flowers usually start to fade a few hours before the petals start showing visible curling. They prefer full solar exposure throughout the day, and mesic soils. Some morning glories, such as Ipomoea muricata, are night-blooming flowers.",
    "37": "South Africa’s Cape Floral Region is a biodiversity hotspot comprising 13 protected areas in the Western and Eastern Cape provinces. It includes the city of Cape Town’s Table Mountain National Park, known for its flat-top mountain, Boulders Beach penguins and the Cape of Good Hope at the Cape Peninsula’s tip. Kirstenbosch National Botanical Garden, at the foot of Table Mountain, is rich in local fynbos plants.",
    "56": "'Bishop of Llandaff' is a cultivar of the dahlia, a garden plant. It is a branching, tuberous tender perennial with dark purple, almost black, foliage. This produces a stunning contrast with its scarlet flowers. The plant was first bred by Fred Treseder, a Cardiff nurseryman.[1] It was selected by and named to honour Joshua Pritchard Hughes, Bishop of Llandaff, in 1924 and won the RHS Award of Garden Merit in 1928. The plant is about 1 m tall and flowers from June until September. As with all dahlias, frost blackens its foliage, and its tubers need to be overwintered in a dry, frost-free place.",
    "60": "The appropriately-named October Sky Dahlia boasts lush, 5-inch blooms with a gorgeous ombre of sunny yellow that transitions right into salmon pink on the outermost petals. As the flowers mature, the yellow retreats to the center, surrounded by more and more salmon and pink.This strong performer can reach heights of up to 5 feet. It is naturally deer resistant and does best in well-drained soil in a sunny spot. And no one needs to tell you that dahlias make an incredible cut flower! Leave in the garden in zones 8 and higher. Dig up and store for the winter in cooler regions.",
    "82": "Clematis is a genus of about 300 species within the buttercup family, Ranunculaceae. Their garden hybrids have been popular among gardeners,[3] beginning with Clematis × jackmanii, a garden standby since 1862; more hybrid cultivars are being produced constantly. They are mainly of Chinese and Japanese origin. Most species are known as clematis in English, while some are also known as traveller's joy, a name invented for the sole British native, C. vitalba, by the herbalist John Gerard; virgin's bower for C. terniflora, C. virginiana, and C. viticella; old man's beard, applied to several with prominent seedheads; leather flower for those with fleshy petals; or vase vine for the North American Clematis viorna.",
    "58": "Geranium is a genus of 422 species of annual, biennial, and perennial plants that are commonly known as geraniums or cranesbills. They are found throughout the temperate regions of the world and the mountains of the tropics, but mostly in the eastern part of the Mediterranean region.The palmately cleft leaves are broadly circular in form. The flowers have five petals and are coloured white, pink, purple or blue, often with distinctive veining. Geraniums will grow in any soil as long as it is not waterlogged. Propagation is by semiripe cuttings in summer, by seed, or by division in autumn or spring.",
    "75": "Datura stramonium, known by the common names thorn apple, jimsonweed (jimson weed) or devil's snare, is a plant species in the nightshade family and Datura genus. Its likely origin was in Central America, and it has been introduced in many world regions. It is an aggressive invasive weed in temperate climates across the world.D. stramonium has frequently been employed in traditional medicine to treat a variety of ailments. It has also been used as a hallucinogen (of the anticholinergic, deliriant type), taken entheogenically to cause intense visions.",
    "41": "Gerbera jamesonii is a species of flowering plant in the genus Gerbera. It is indigenous to South Eastern Africa and commonly known as the Barberton daisy, the Transvaal daisy, and as Barbertonse madeliefie in Afrikaans.",
    "95": "Bougainvillea is a genus of thorny ornamental vines, bushes, or trees. It is native to Eastern South America, from Brazil, west to Peru, and south to southern Argentina. Different authors accept from four to 18 species in the genus. The inflorescence consists of large colourful sepal-like bracts which surround three simple waxy flowers.The vine species grow anywhere from 1 to 12 m (3 to 40 ft.) tall, scrambling over other plants with their spiky thorns. They are evergreen where rainfall occurs all year, or deciduous if there is a dry season. The leaves are alternate, simple ovate-acuminate, 4–13 cm long and 2–6 cm broad.",
    "43": "Gladiolus (from Latin, the diminutive of gladius, a sword) is a genus of perennial cormous flowering plants in the iris family (Iridaceae).It is sometimes called the 'sword lily', but is usually called by its generic name (plural gladioli).The genus occurs in Asia, Mediterranean Europe, South Africa, and tropical Africa. The center of diversity is in the Cape Floristic Region. The genera Acidanthera, Anomalesia, Homoglossum, and Oenostachys, formerly considered distinct, are now included in Gladiolus.",
    "83": "Hibiscus is a genus of flowering plants in the mallow family, Malvaceae. The genus is quite large, comprising several hundred species that are native to warm temperate, subtropical and tropical regions throughout the world, originating in Africa.[citation needed] Member species are renowned for their large, showy flowers and those species are commonly known simply as hibiscus, or less widely known as rose mallow. Other names include hardy hibiscus, rose of sharon, and tropical hibiscus.The genus includes both annual and perennial herbaceous plants, as well as woody shrubs and small trees.",
    "78": "Nelumbo nucifera, also known as Indian lotus, sacred lotus, bean of India, Egyptian bean or simply lotus, is one of two extant species of aquatic plant in the family Nelumbonaceae. It is often colloquially called a water lily.Lotus plants are adapted to grow in the flood plains of slow-moving rivers and delta areas. Stands of lotus drop hundreds of thousands of seeds every year to the bottom of the pond. While some sprout immediately, and most are eaten by wildlife, the remaining seeds can remain dormant for an extensive period of time as the pond silts in and dries out. During flood conditions, sediments containing these seeds are broken open, and the dormant seeds rehydrate and begin a new lotus colony. Under favorable circumstances the seeds of this aquatic perennial may remain viable for many years, with the oldest recorded lotus germination being from seeds 1,300 years old recovered from a dry lakebed in northeastern China",
    "88": "Cyclamen  is a genus of 23 species of perennial flowering plants in the family Primulaceae. Cyclamen species are native to Europe and the Mediterranean Basin east to Iran, with one species in Somalia. They grow from tubers and are valued for their flowers with upswept petals and variably patterned leaves.",
    "94": "Digitalis  is a genus of about 20 species of herbaceous perennials, shrubs, and biennials commonly called foxgloves.This genus was traditionally placed in the figwort family Scrophulariaceae, but recent phylogenetic research has placed it in the much enlarged family Plantaginaceae. This genus is native to western and southwestern Europe, western and central Asia and northwestern Africa. The flowers are produced on a tall spike, are tubular, and vary in colour with species, from purple to pink, white, and yellow. The scientific name means finger-like and refers to the ease with which a flower can be fitted over a human fingertip.",
    "81": "Plumeria is a genus of flowering plants in the family Apocynaceae. Most species are deciduous shrubs or small trees. The species variously are endemic to Mexico, Central America and the Caribbean, and as far south as Brazil and north as Florida, but are grown as cosmopolitan ornamentals in warm regions. Common names for plants in the genus vary widely according to region, variety, and whim, but frangipani or variations on that theme are the most common. Plumeria is also used as a common name, especially in horticultural circles.",
    "74": "A rose is a woody perennial flowering plant of the genus Rosa, in the family Rosaceae, or the flower it bears. There are over three hundred species and tens of thousands of cultivars. They form a group of plants that can be erect shrubs, climbing, or trailing, with stems that are often armed with sharp prickles. Flowers vary in size and shape and are usually large and showy, in colours ranging from white through yellows and reds. Most species are native to Asia, with smaller numbers native to Europe, North America, and northwestern Africa",
    "89": "Watercress or yellowcress is a species of aquatic flowering plant in the cabbage family Brassicaceae. Its botanical name is Nasturtium officinale.Watercress is a rapidly growing, perennial plant native to Europe and Asia. It is one of the oldest known leaf vegetables consumed by humans. Watercress and many of its relatives, such as garden cress, mustard, radish, and wasabi, are noteworthy for their piquant flavors.The hollow stems of watercress will float. The leaf structure is pinnately compound. Small, white, and green flowers are produced in clusters and are frequently visited by insects, especially hoverflies, such as Eristalis flies",
    "73": "Nymphaeaceae is a family of flowering plants, commonly called water lilies. They live as rhizomatous aquatic herbs in temperate and tropical climates around the world. The family contains five genera with about 70 known species. Water lilies are rooted in soil in bodies of water, with leaves and flowers floating on or emergent from the surface. The leaves are round, with a radial notch in Nymphaea and Nuphar, but fully circular in Victoria and Euryale.",
    "46": "Erysimum, or wallflower, is a genus of flowering plants in the cabbage family, Brassicaceae. It includes more than 150 species, both popular garden plants and many wild forms.[1][2][3][4][5][6] The genus Cheiranthus is sometimes included here in whole or in part. Erysimum has since the early 21st century been ascribed to a monogeneric cruciferous tribe, Erysimeae, characterised by sessile, stellate (star-shaped) and/or malpighiaceous (two-sided) trichomes, yellow to orange flowers and multiseeded siliques.",
    "77": "Passiflora, known also as the passion flowers or passion vines, is a genus of about 550 species of flowering plants, the type genus of the family Passifloraceae.They are mostly tendril-bearing vines, with some being shrubs or trees. They can be woody or herbaceous. Passion flowers produce regular and usually showy flowers with a distinctive corona. The flower is pentamerous and ripens into an indehiscent fruit with numerous seeds.",
    "51": "Petunia is genus of 20 species of flowering plants of South American origin. The popular flower of the same name derived its epithet from the French, which took the word petun, meaning tobacco, from a Tupi–Guarani language. An annual, most of the varieties seen in gardens are hybrids (Petunia × atkinsiana, also known as Petunia × hybrida)."
}